<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
body {
	background-color: #D5FFD5;
}
.Estilo1 {font-family: Geneva, Arial, Helvetica, sans-serif}
.Estilo2 {
	font-family: Geneva, Arial, Helvetica, sans-serif;
	font-size: x-large;
	font-weight: bold;
}
.Estilo3 {
	font-family: Geneva, Arial, Helvetica, sans-serif;
	font-weight: bold;
	font-size: large;
}
-->
</style></head>

<body>
<blockquote>
  <blockquote>
    <p>&nbsp;</p>
    <p class="Estilo2">TRANSMETA</p>
    <hr />
    <p class="Estilo1">El&nbsp;<strong>Transmeta Efficeon</strong>&nbsp;es un&nbsp;microprocesador&nbsp;para las&nbsp;arquitecturas&nbsp;x86&nbsp;dise&ntilde;ado para aplicaciones de bajo consumo, como&nbsp;Tablet PCs&nbsp;y para competir comercialmente con el&nbsp;Pentium M&nbsp;de&nbsp;Intel. Tiene un dise&ntilde;o&nbsp;VLIW&nbsp;(<em>Very Long Instruction Word</em>), con un tama&ntilde;o de palabra de instrucci&oacute;n de 256&nbsp;bits, adem&aacute;s de ser compatible con el juego de instrucciones&nbsp;MMX,&nbsp;SSE&nbsp;y SSE2.</p>
    <p class="Estilo1">En la actualidad se fabrica con una tecnolog&iacute;a de 0.13 micras, aunque&nbsp;<a href="https://es.wikipedia.org/wiki/Transmeta" title="Transmeta">Transmeta</a>&nbsp;espera bajar esa cifra en breve.</p>
    <p class="Estilo3">CRUSOE</p>
    <p align="center" class="Estilo3"><img src="IMG/jhv.gif" width="385" height="235" /></p>
    <p><span class="Estilo1"><strong>Crusoe</strong> es una familia de&nbsp;<a href="https://es.wikipedia.org/wiki/Microprocesador" title="Microprocesador">microprocesadores</a>&nbsp;compatibles&nbsp;x86&nbsp;fabricados por&nbsp;Transmeta. Utilizan una capa de abstracci&oacute;n de software o&nbsp;m&aacute;quina virtual, conocida como Code Morphing Software (CMS) y que se ejecuta en un n&uacute;cleo&nbsp;VLIW. CMS es la &uacute;nica aplicaci&oacute;n escrita para la arquitectura VLIW nativa, y traduce el flujo entrante de instrucciones x86 a instrucciones VLIW.</span></p>
    <p class="Estilo1">En teor&iacute;a, es posible modificar CMS para que maneje otros flujos de instrucciones (por ejemplo, para emular otros microprocesadores), si bien no parece que esto vaya a suceder, puesto que es probable que el hardware a utilizar ya haya sido optimizado para x86.</p>
    <p class="Estilo1">La adici&oacute;n de una capa de abstracci&oacute;n entre el flujo de instrucciones x86 y el hardware permite que la arquitectura cambie sin romper la compatibilidad x86, simplemente modificando CMS. Por ejemplo&nbsp;Efficeon, la segunda generaci&oacute;n del Crusoe, tiene un n&uacute;cleo VLIW de 256 bits, mientras que el de la primera era un VLIW de 128 bits.</p>
    <p class="Estilo1">Los Crusoe realizan mediante software algunas de las funciones cl&aacute;sicamente implementadas mediante hardware, como por ejemplo la reordenaci&oacute;n de instrucciones. Esto resulta en un hardware m&aacute;s simple y con menos&nbsp;transistores. La relativa simplicidad del hardware hace que el Crusoe consuma menos energ&iacute;a (y por tanto disipe menos calor) que otros procesadores compatibles x86 que trabajan a la misma frecuencia de reloj.</p>
  </blockquote>
</blockquote>
</body>
</html>
