<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
body {
	background-color: #D5FFD5;
}
.Estilo1 {
	font-family: Geneva, Arial, Helvetica, sans-serif;
	font-weight: bold;
	font-size: x-large;
}
.Estilo2 {font-family: Geneva, Arial, Helvetica, sans-serif}
.Estilo3 {font-family: Geneva, Arial, Helvetica, sans-serif; font-size: x-large; }
-->
</style></head>

<body>
<blockquote>
  <blockquote>
    <p>&nbsp;</p>
    <h1 class="Estilo3" id="firstHeading">VIA Technologies</h1>
    <hr />
    <p align="center"><img src="IMG/jh.gif" width="921" height="334" /></p>
    <p class="Estilo2">La empresa fue fundada en&nbsp;1987&nbsp;en&nbsp;Silicon Valley&nbsp;(Fremont,&nbsp;California) por&nbsp;<a href="https://es.wikipedia.org/w/index.php?title=Wen_Chi_Chen&amp;action=edit&amp;redlink=1" title="Wen Chi Chen (a&uacute;n no redactado)">Wen Chi Chen</a>&nbsp;(&#38515;&#25991;&#29734;), entre otros. Fue empleado de&nbsp;Intel&nbsp;antes de unirse a la&nbsp;<strong>Symphony Laboratories</strong>, y siendo director general (CEO) de Symphony decide transformarla en VIA. Chen transfiere los empleados de Symphony a Taiw&aacute;n para iniciar la fabricaci&oacute;n de chips. En&nbsp;1992&nbsp;se traslada tambi&eacute;n la sede central a&nbsp;Taip&eacute;i, Taiw&aacute;n.</p>
    <p class="Estilo2">En&nbsp;1996&nbsp;tiene un papel importante en el grupo del&nbsp;est&aacute;ndar&nbsp;PC Common Architecture, impulsando el cambio del&nbsp;bus ISA&nbsp;al bus&nbsp;PCI.</p>
    <p class="Estilo2">En&nbsp;1999&nbsp;adquiri&oacute; la mayor parte de&nbsp;Cyrix&nbsp;(por aquel entonces una divisi&oacute;n de&nbsp;National Semiconductor) y&nbsp;Centaur Technology&nbsp;(inicialmente perteneciente a&nbsp;IDT) haci&eacute;ndola entrar en el mercado de los&nbsp;microprocesadores&nbsp;x86. VIA es el creador de los procesadores&nbsp;VIA C3&nbsp;(lanzado en&nbsp;2001) y&nbsp;VIA C7&nbsp;(lanzado en&nbsp;2005) y de la plataforma&nbsp;EPIA. La plataforma Cyrix&nbsp;MediaGX&nbsp;permanece en poder de National Semiconductor. Estos procesadores se han comercializado sobre todo para el segmento de miniport&aacute;tiles y&nbsp;UMPC&nbsp;como el prototipo&nbsp;VIA NanoBook&nbsp;y los miniport&aacute;tiles basados en &eacute;l como el&nbsp;Cloudbook.</p>
    <p class="Estilo2">En&nbsp;2001&nbsp;crea una&nbsp;<em>joint venture</em>&nbsp;con SonicBlue (Diamond Multimedia) para la empresa de&nbsp;GPUs&nbsp;S3 Graphics. Tras la&nbsp;quiebra&nbsp;de SonicBlue, S3 se convierte en una filial de VIA</p>
    <p class="Estilo2">En octubre de 2001, VIA anuncia la creaci&oacute;n de la VIA Platform Solutions Division (VPSD), que se encargar&iacute;a del dise&ntilde;o de un nuevo rango de placas base y plataformas bajo sello VIA En&nbsp;2004, la divisi&oacute;n cambia su nombre a VIA Embedded Platform Divisi&oacute;n (VEPD), como resultado de la focalizaci&oacute;n en el mercado de la plataforma EPIA y las CPUs de bajo consumo.</p>
    <p class="Estilo2">En 2002, VIA lanz&oacute; el Proyecto Canaan, fruto del cual se crearon en&nbsp;2003&nbsp;dos nuevas divisiones&nbsp;: VIA Optical Solution, Inc. (controladores &oacute;pticos de almacenamiento) y VIA Networking Technologies, Inc. (redes y comunicaciones). Adem&aacute;s adquiere el equipo de dise&ntilde;o CDMA2000 a LSI Logic para formar la filial VIA Telecom Inc. (con sede en&nbsp;San Diego, California) y focalizada en el est&aacute;ndar&nbsp;CDMA2000.</p>
    <p class="Estilo2">En febrero de&nbsp;2005, VIA celebr&oacute; la fabricaci&oacute;n de su chipset VIA AMD n&uacute;mero 100 millones.</p>
    <p class="Estilo1">VIA</p>
    <p class="Estilo2">El&nbsp;VIA Nano&nbsp;(su nombre c&oacute;digo antiguo fue&nbsp;VIA Isaiah) es un&nbsp;procesador&nbsp;de 64 Bits para computadoras personales (CPU), anunciado por&nbsp;VIA Technologies&nbsp;desde 2004.</p>
    <p class="Estilo2">En 2007 VIA anunci&oacute; oficialmente que su divisi&oacute;n de CPU,&nbsp;Centaur Technology, estaba trabajando en una nueva arquitectura para procesadores en los &uacute;ltimos cuatro a&ntilde;os, lo que confirma los anteriores rumores. Esta nueva arquitectura ha sido dise&ntilde;ado desde cero, con fecha de lanzamiento planeada para principios de 2008.</p>
    <p class="Estilo2">El 24 de enero de 2008, el dise&ntilde;o se inaugur&oacute; y present&oacute; no s&oacute;lo como un procesador, sino tambi&eacute;n como la arquitectura VIA Isa&iacute;as de 64 bits.</p>
    <p class="Estilo2">El 28 de mayo de 2008, VIA anunci&oacute; la disposici&oacute;n final de procesadores Isaiah tanto de voltaje est&aacute;ndar como variantes de baja tensi&oacute;n, mientras que tambi&eacute;n presenta el procesador de marca Nano</p>
    <p class="Estilo2">A diferencia de&nbsp;Intel&nbsp;y&nbsp;AMD, VIA utiliza dos nombres clave para el desarrollo de cada uno de sus n&uacute;cleos de CPU. En este caso, el c&oacute;digo &laquo;CN&raquo; se utiliz&oacute; en los EE. UU. por Centaur Technology. Nombres B&iacute;blicos se utilizan como c&oacute;digos de los n&uacute;cleos de VIA en Taiw&aacute;n, Isaiah (Isa&iacute;as) fue el nombre elegido para este procesador y la arquitectura.</p>
    <p class="Estilo2">Se espera que la VIA Isa&iacute;as sea el doble de r&aacute;pido en el rendimiento en enteros y cuatro veces m&aacute;s r&aacute;pido en punto flotante respecto a la generaci&oacute;n anterior (VIA Esther) a una velocidad de reloj equivalente. El consumo de energ&iacute;a tambi&eacute;n se espera que est&eacute; a la par con la generaci&oacute;n anterior de CPUs VIA, con un&nbsp;TDP&nbsp;que va desde 5W a 25W.</p>
    <p class="Estilo2">Siendo un dise&ntilde;o completamente nuevo, la arquitectura Isaiah fue construida con soporte para caracter&iacute;sticas como el&nbsp;conjunto de instrucciones&nbsp;<a href="https://es.wikipedia.org/wiki/X86-64" title="X86-64">x86-64</a>&nbsp;y tecnolog&iacute;a de&nbsp;virtualizaci&oacute;n&nbsp;que no se dispon&iacute;a en anteriores microprocesadores VIA, como la l&iacute;nea&nbsp;<a href="https://es.wikipedia.org/wiki/VIA_C7" title="">VIA C7</a></p>
    <p class="Estilo1">&nbsp;</p>
  </blockquote>
</blockquote>
</body>
</html>
