<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
body {
	background-color: #D5FFD5;
}
.Estilo1 {font-family: Calibri}
.Estilo2 {
	font-family: Calibri;
	font-weight: bold;
	font-size: xx-large;
}
.Estilo3 {
	font-size: 18px;
	font-weight: bold;
}
.Estilo7 {font-family: Calibri; font-weight: bold; font-size: 16px; }
.Estilo8 {font-size: large}
-->
</style></head>

<body>
<blockquote>
  <p class="Estilo2">HISTORIA DEL PROCESADOR<a name="inicio" id="inicio"></a></p>
  <hr />
  <p class="Estilo7"><a href="#1971">1971-1976</a>	<a href="#1999">1999-2004</a></p>
  <p class="Estilo7"><a href="#1978">1978-1991</a> <a href="#2004">2004-2008</a></p>
  <p class="Estilo7"><a href="#1993">1993-1996</a> <a href="#2008">2008-2012</a></p>
  <p class="Estilo7"><a href="#1996">1996-1999</a> <a href="#2013">2013-2017</a></p>
  <table width="806" height="144" border="1">
    <tr>
      <th width="234" scope="col">A&Ntilde;O</th>
      <th width="85" scope="col">1971</th>
      <th width="41" scope="col">1972</th>
      <th width="31" scope="col">1974</th>
      <th width="33" scope="col">1976</th>
      <th width="33" scope="col">1978</th>
      <th width="33" scope="col">1982</th>
      <th width="33" scope="col">1985</th>
      <th width="33" scope="col">1991</th>
    </tr>
    <tr>
      <th scope="row">ACONTESIMIENTO</th>
      <td>Intel lanza al mercado el modelo 4004, su primer microprocesador </td>
      <td>La empresa anuncio el lanzamiento del primer microprocesador de 8 bits, bajo el nombre de 8008 </td>
      <td>el microprocesador intel 8080, sale al mercado con proposito general </td>
      <td>intel 8085, ofrece una ventaja en la fuente de alimentacion de 5 voltios </td>
      <td>microprocesador 8086 de 16 bits, se vuelve un estandar en la industria </td>
      <td>lanzamineto al mercado el microprocesador 80286 de 16 bits </td>
      <td>se presenta el procesador intel 386 un chip de 32 bits </td>
      <td>sale el primer procesador con arquitectura x86, intel 80486 </td>
    </tr>
  </table>
  <p class="Estilo7">&nbsp;</p>
  <p class="Estilo1">Hasta los primeros a&ntilde;os de la d&eacute;cada de 1970 los diferentes componentes electr&oacute;nicos que formaban un procesador no pod&iacute;an ser un &uacute;nico circuito integrado, era necesario utilizar dos o tres &laquo;chips&raquo; para hacer una CPU (uno era el &laquo;ALU&raquo; &ndash; Arithmetical Logic Unit, el otro la &raquo; control Unit&raquo;, el otro el &raquo; Register Bank&raquo;, etc.). En 1971 la compa&ntilde;&iacute;a Intel consigui&oacute; por primera vez poner todos los transistores que constitu&iacute;an un procesador sobre un &uacute;nico circuito integrado, el&raquo;4004 &laquo;&lsquo;, nac&iacute;a el microprocesador.</p>
  <p class="Estilo1">Seguidamente se expone una lista ordenada cronol&oacute;gicamente de los microprocesadores m&aacute;s populares que fueron surgiendo. En la URSS se realizaron otros sistemas que dieron lugar a la serie microprocesador Elbrus.</p>
  <p class="Estilo1"><span class="Estilo3">1971: El Intel 4004</span><a name="1971" id="1971"></a></p>
  <hr />
  <p class="Estilo1"><br />
    El 4004 fue el primer microprocesador del mundo, creado en un simple chip y desarrollado por Intel. Era un CPU de 4 bits y tambi&eacute;n fue el primero disponible comercialmente. Este desarrollo impuls&oacute; la calculadora de Busicom[1] e inici&oacute; el camino para dotar de &laquo;inteligencia&raquo; a objetos inanimados y asimismo, a la computadora personal.</p>
  <p align="center" class="Estilo1"><img src="IMG/4004.jpg" width="342" height="206" /></p>
  <p class="Estilo1">&nbsp;</p>
  <p class="Estilo1"><span class="Estilo3">1972: El Intel 8008</span></p>
  <hr />
  <p class="Estilo1"><br />
    Codificado inicialmente como 1201, fue pedido a Intel por Computer Terminal Corporation para usarlo en su terminal programable Datapoint 2200, pero debido a que Intel termin&oacute; el proyecto tarde y a que no cumpl&iacute;a con la expectativas de Computer Terminal Corporation, finalmente no fue usado en el Datapoint. Posteriormente Computer Terminal Corporation e Intel acordaron que el i8008 pudiera ser vendido a otros clientes.</p>
  <p class="Estilo1"><span class="Estilo3">1974: El SC/MP</span></p>
  <hr />
  <p class="Estilo1"><br />
    El SC/MP desarrollado por National Semiconductor, fue uno de los primeros microprocesadores, y estuvo disponible desde principio de 1974. El nombre SC/MP (popularmente conocido como &laquo;Scamp&raquo;) es el acr&oacute;nimo de Simple Cost-effective Micro Processor (Microprocesador simple y rentable). Presenta un bus de direcciones de 16 bits y un bus de datos de 8 bits. Una caracter&iacute;stica, avanzada para su tiempo, es la capacidad de liberar los buses a fin de que puedan ser compartidos por varios procesadores. Este microprocesador fue muy utilizado, por su bajo costo, y provisto en kits, para prop&oacute;sitos educativos, de investigaci&oacute;n y para el desarrollo de controladores industriales diversos.</p>
  <p class="Estilo1"><span class="Estilo3"><strong>1974: El Intel 8080</strong></span></p>
  <hr />
  <p class="Estilo1"><br />
    EL 8080 se convirti&oacute; en la CPU de la primera computadora personal, la Altair 8800 de MITS, seg&uacute;n se alega, nombrada as&iacute; por un destino de la Nave Espacial &laquo;Starship&raquo; del programa de televisi&oacute;n Viaje a las Estrellas, y el IMSAI 8080, formando la base para las m&aacute;quinas que ejecutaban el sistema operativo CP/M-80. Los fan&aacute;ticos de las computadoras pod&iacute;an comprar un equipo Altair por un precio (en aquel momento) de 395 USD. En un periodo de pocos meses, se vendieron decenas de miles de estos PC.</p>
  <p class="Estilo1"><span class="Estilo3">1975: Motorola 6800</span></p>
  <hr />
  <p class="Estilo1"><br />
    Se fabrica, por parte de Motorola, el Motorola MC6800, m&aacute;s conocido como 6800. Fue lanzado al mercado poco despu&eacute;s del Intel 8080. Su nombre proviene de que conten&iacute;a aproximadamente 6800 transistores. Varios de los primeras microcomputadoras de los a&ntilde;os 1970 usaron el 6800 como procesador. Entre ellas se encuentran la SWTPC 6800, que fue la primera en usarlo, y la muy conocida Altair 680. Este microprocesador se utiliz&oacute; profusamente como parte de un kit para el desarrollo de sistemas controladores en la industria. Partiendo del 6800 se crearon varios procesadores derivados, siendo uno de los m&aacute;s potentes el Motorola 6809</p>
  <p class="Estilo1"><span class="Estilo3">1976: El Z80</span></p>
  <hr />
  <p class="Estilo1"><br />
    La compa&ntilde;&iacute;a Zilog Inc. crea el Zilog Z80. Es un microprocesador de 8 bits construido en tecnolog&iacute;a NMOS, y fue basado en el Intel 8080. B&aacute;sicamente es una ampliaci&oacute;n de &eacute;ste, con lo que admite todas sus instrucciones. Un a&ntilde;o despu&eacute;s sale al mercado el primer computador que hace uso del Z80, el Tandy TRS-80 Model 1 provisto de un Z80 a 1,77 MHz y 4 KB de RAM. Es uno de los procesadores de m&aacute;s &eacute;xito del mercado, del cual se han producido numerosas versiones cl&oacute;nicas, y sigue siendo usado de forma extensiva en la actualidad en multitud de sistemas embebidos. La compa&ntilde;&iacute;a Zilog fue fundada 1974 por Federico Faggin, quien fue dise&ntilde;ador jefe del microprocesador Intel 4004 y posteriormente del Intel 8080.</p>
  <p class="Estilo1"><span class="Estilo3">1978: Los Intel 8086 y 8088</span><a name="1978" id="1978"></a></p>
  <hr />
  <p class="Estilo1"><br />
    Una venta realizada por Intel a la nueva divisi&oacute;n de computadoras personales de IBM, hizo que las PC de IBM dieran un gran golpe comercial con el nuevo producto con el 8088, el llamado IBM PC. El &eacute;xito del 8088 propuls&oacute; a Intel a la lista de las 500 mejores compa&ntilde;&iacute;as, en la prestigiosa revista Fortune, y la misma nombr&oacute; la empresa como uno de Los triunfos comerciales de los sesenta.</p>
  <p class="Estilo1"><span class="Estilo3">1982: El Intel 80286</span></p>
  <hr />
  <p class="Estilo1"><br />
    El 80286, popularmente conocido como 286, fue el primer procesador de Intel que podr&iacute;a ejecutar todo el software escrito para su predecesor. Esta compatibilidad del software sigue siendo un sello de la familia de microprocesadores de Intel. Luego de seis a&ntilde;os de su introducci&oacute;n, hab&iacute;a un estimado de 15 millones de PC basadas en el 286, instaladas alrededor del mundo.</p>
  <p class="Estilo1"><span class="Estilo3">1985: El Intel 80386</span></p>
  <hr />
  <p class="Estilo1"><br />
    Este procesador Intel, popularmente llamado 386, se integr&oacute; con 275 000 transistores, m&aacute;s de 100 veces tantos como en el original 4004. El 386 a&ntilde;adi&oacute; una arquitectura de 32 bits, con capacidad para multitarea y una unidad de traslaci&oacute;n de p&aacute;ginas, lo que hizo mucho m&aacute;s sencillo implementar sistemas operativos que usaran memoria virtual.</p>
  <p class="Estilo1"><a href="#inicio" class="Estilo8">&lt;</a></p>
  <p class="Estilo1"><span class="Estilo3">1985: El VAX 78032</span></p>
  <hr />
  <p class="Estilo1"><br />
    El microprocesador VAX 78032 (tambi&eacute;n conocido como DC333), es de &uacute;nico chip y de 32 bits, y fue desarrollado y fabricado por Digital Equipment Corporation (DEC); instalado en los equipos MicroVAX II, en conjunto con su chip coprocesador de coma flotante separado, el 78132, ten&iacute;an una potencia cercana al 90 % de la que pod&iacute;a entregar el minicomputador VAX 11/780 que fuera presentado en 1977. Este microprocesador conten&iacute;a 125 000 transistores, fue fabricado en tecnolog&oacute;a ZMOS de DEC. Los sistemas VAX y los basados en este procesador fueron los preferidos por la comunidad cient&iacute;fica y de ingenier&iacute;a durante la d&eacute;cada del 1980.</p>
  <p class="Estilo1"><span class="Estilo3">1989: El Intel 80486</span></p>
  <hr />
  <p class="Estilo1"><br />
    La generaci&oacute;n 486 realmente signific&oacute; contar con una computadora personal de prestaciones avanzadas, entre ellas, un conjunto de instrucciones optimizado, una unidad de coma flotante o FPU, una unidad de interfaz de bus mejorada y una memoria cach&eacute; unificada, todo ello integrado en el propio chip del microprocesador. Estas mejoras hicieron que los i486 fueran el doble de r&aacute;pidos que el par i386 &ndash; i387 operando a la misma frecuencia de reloj. El procesador Intel 486 fue el primero en ofrecer un coprocesador matem&aacute;tico o FPU integrado; con &eacute;l que se aceleraron notablemente las operaciones de c&aacute;lculo. Usando una unidad FPU las operaciones matem&aacute;ticas m&aacute;s complejas son realizadas por el coprocesador de manera pr&aacute;cticamente independiente a la funci&oacute;n del procesador principal.</p>
  <p class="Estilo1"><span class="Estilo3">1991: El AMD AMx86</span></p>
  <hr />
  <p class="Estilo1"><br />
    Procesadores fabricados por AMD 100 % compatible con los c&oacute;digos de Intel de ese momento. Llamados &laquo;clones&raquo; de Intel, llegaron incluso a superar la frecuencia de reloj de los procesadores de Intel y a precios significativamente menores. Aqu&iacute; se incluyen las series Am286, Am386, Am486 y Am586.</p>
  <p class="Estilo1"><span class="Estilo3">1993: PowerPC 601</span><a name="1993" id="1993"></a></p>
  <hr />
  <p class="Estilo1"><br />
    Es un procesador de tecnolog&iacute;a RISC de 32 bits, en 50 y 66 MHz. En su dise&ntilde;o utilizaron la interfaz de bus del Motorola 88110. En 1991, IBM busca una alianza con Apple y Motorola para impulsar la creaci&oacute;n de este microprocesador, surge la alianza AIM (Apple, IBM y Motorola) cuyo objetivo fue quitar el dominio que Microsoft e Intel ten&iacute;an en sistemas basados en los 80386 y 80486. PowerPC (abreviada PPC o MPC) es el nombre original de la familia de procesadores de arquitectura de tipo RISC, que fue desarrollada por la alinza AIM. Los procesadores de esta familia son utilizados principalmente en computadores Macintosh de Apple Computer y su alto rendimiento se debe fuertemente a su arquitectura tipo RISC.</p>
  <p class="Estilo1"><span class="Estilo3">1993: El Intel Pentium</span></p>
  <hr />
  <p class="Estilo1"><br />
    El microprocesador de Pentium pose&iacute;a una arquitectura capaz de ejecutar dos operaciones a la vez, gracias a sus dos tuber&iacute;as de datos de 32 bits cada uno, uno equivalente al 486DX(u) y el otro equivalente a 486SX(u). Adem&aacute;s, estaba dotado de un bus de datos de 64 bits, y permit&iacute;a un acceso a memoria de 64 bits (aunque el procesador segu&iacute;a manteniendo compatibilidad de 32 bits para las operaciones internas, y los registros tambi&eacute;n eran de 32 bits). Las versiones que inclu&iacute;an instrucciones MMX no s&oacute;lo brindaban al usuario un m&aacute;s eficiente manejo de aplicaciones multimedia, sino que tambi&eacute;n se ofrec&iacute;an en velocidades de hasta 233 MHz. Se incluy&oacute; una versi&oacute;n de 200 MHz y la m&aacute;s b&aacute;sica trabajaba a alrededor de 166 MHz de frecuencia de reloj. El nombre Pentium, se mencion&oacute; en las historietas y en charlas de la televisi&oacute;n a diario, en realidad se volvi&oacute; una palabra muy popular poco despu&eacute;s de su introducci&oacute;n.</p>
  <p class="Estilo1"><span class="Estilo3">1994: EL PowerPC 620</span></p>
  <hr />
  <p class="Estilo1"><br />
    En este a&ntilde;o IBM y Motorola desarrollan el primer prototipo del procesador PowerPC de 64 bit,4 la implementaci&oacute;n m&aacute;s avanzada de la arquitectura PowerPC, que estuvo disponible al a&ntilde;o pr&oacute;ximo. El 620 fue dise&ntilde;ado para su utilizaci&oacute;n en servidores, y especialmente optimizado para usarlo en configuraciones de cuatro y hasta ocho procesadores en servidores de aplicaciones de base de datos y v&iacute;deo. Este procesador incorpora siete millones de transistores y corre a 133 MHz. Es ofrecido como un puente de migraci&oacute;n para aquellos usuarios que quieren utilizar aplicaciones de 64 bits, sin tener que renunciar a ejecutar aplicaciones de 32 bits.</p>
  <p class="Estilo1"><a href="#inicio" class="Estilo8">&lt;</a></p>
  <p class="Estilo1"><span class="Estilo3">1995: EL Intel Pentium Pro</span></p>
  <hr />
  <p class="Estilo1"><br />
    Lanzado al mercado en oto&ntilde;o de 1995, el procesador Pentium Pro (profesional) se dise&ntilde;&oacute; con una arquitectura de 32 bits. Se us&oacute; en servidores y los programas y aplicaciones para estaciones de trabajo (de redes) impulsaron r&aacute;pidamente su integraci&oacute;n en las computadoras. El rendimiento del c&oacute;digo de 32 bits era excelente, pero el Pentium Pro a menudo era m&aacute;s lento que un Pentium cuando ejecutaba c&oacute;digo o sistemas operativos de 16 bits. El procesador Pentium Pro estaba compuesto por alrededor de 5&rsquo;5 millones de transistores.</p>
  <p class="Estilo1"><span class="Estilo3">1996: El AMD K5</span></p>
  <hr />
  <p class="Estilo1"><br />
    Habiendo abandonado los clones, AMD fabricada con tecnolog&iacute;as an&aacute;logas a Intel. AMD sac&oacute; al mercado su primer procesador propio, el K5, rival del Pentium. La arquitectura RISC86 del AMD K5 era m&aacute;s semejante a la arquitectura del Intel Pentium Pro que a la del Pentium. El K5 es internamente un procesador RISC con una Unidad x86- decodificadora, transforma todos los comandos x86 (de la aplicaci&oacute;n en curso) en comandos RISC. Este principio se usa hasta hoy en todas las CPU x86. En la mayor&iacute;a de los aspectos era superior el K5 al Pentium, incluso de inferior precio, sin embargo AMD ten&iacute;a poca experiencia en el desarrollo de microprocesadores y los diferentes hitos de producci&oacute;n marcados se fueron superando con poco &eacute;xito, se retras&oacute; 1 a&ntilde;o de su salida al mercado, a raz&oacute;n de ello sus frecuencias de trabajo eran inferiores a las de la competencia, y por tanto, los fabricantes de PC dieron por sentado que era inferior.</p>
  <p class="Estilo1"><span class="Estilo3">1996: Los AMD K6 y AMD K6-2</span><a name="1996" id="1996"></a></p>
  <hr />
  <p class="Estilo1"><br />
    Con el K6, AMD no s&oacute;lo consigui&oacute; hacerle seriamente la competencia a los Pentium MMX de Intel, sino que adem&aacute;s amarg&oacute; lo que de otra forma hubiese sido un pl&aacute;cido dominio del mercado, ofreciendo un procesador casi a la altura del Pentium II pero por un precio muy inferior. En c&aacute;lculos en coma flotante, el K6 tambi&eacute;n qued&oacute; por debajo del Pentium II, pero por encima del Pentium MMX y del Pro. El K6 cont&oacute; con una gama que va desde los 166 hasta los m&aacute;s de 500 MHz y con el juego de instrucciones MMX, que ya se han convertido en est&aacute;ndares.</p>
  <p class="Estilo1">M&aacute;s adelante se lanz&oacute; una mejora de los K6, los K6-2 de 250 nan&oacute;metros, para seguir compitiendo con los Pentium II, siendo este &uacute;ltimo superior en tareas de coma flotante, pero inferior en tareas de uso general. Se introduce un juego de instrucciones SIMD denominado 3DNow!</p>
  <p class="Estilo1"><span class="Estilo3">1997: El Intel Pentium II</span></p>
  <hr />
  <p class="Estilo1"><br />
    Un procesador de 7&rsquo;5 millones de transistores, se busca entre los cambios fundamentales con respecto a su predecesor, mejorar el rendimiento en la ejecuci&oacute;n de c&oacute;digo de 16 bits, a&ntilde;adir el conjunto de instrucciones MMX y eliminar la memoria cach&eacute; de segundo nivel del n&uacute;cleo del procesador, coloc&aacute;ndola en una tarjeta de circuito impreso junto a &eacute;ste. Gracias al nuevo dise&ntilde;o de este procesador, los usuarios de PC pueden capturar, revisar y compartir fotograf&iacute;as digitales con amigos y familia v&iacute;a Internet; revisar y agregar texto, m&uacute;sica y otros; con una l&iacute;nea telef&oacute;nica; el enviar v&iacute;deo a trav&eacute;s de las l&iacute;neas normales del tel&eacute;fono mediante Internet se convierte en algo cotidiano.</p>
  <p class="Estilo1"><span class="Estilo3">1998: El Intel Pentium II Xeon</span></p>
  <hr />
  <p class="Estilo1"><br />
    Los procesadores Pentium II Xeon se dise&ntilde;an para cumplir con los requisitos de rendimiento en computadoras de medio-rango, servidores m&aacute;s potentes y estaciones de trabajo (workstations). Consistente con la estrategia de Intel para dise&ntilde;ar productos de procesadores con el objetivo de llenar segmentos de los mercados espec&iacute;ficos, el procesador Pentium II Xeon ofrece innovaciones t&eacute;cnicas dise&ntilde;adas para las estaciones de trabajo y servidores que utilizan aplicaciones comerciales exigentes, como servicios de Internet, almacenamiento de datos corporativos, creaciones digitales y otros. Pueden configurarse sistemas basados en este procesador para integrar de cuatro u ocho procesadores trabajando en paralelo, tambi&eacute;n m&aacute;s all&aacute; de esa cantidad.</p>
  <p class="Estilo1"><a href="#inicio" class="Estilo8">&lt;</a></p>
  <p class="Estilo1"><span class="Estilo3">1999: El Intel Celeron</span></p>
  <hr />
  <p class="Estilo1"><br />
    Continuando la estrategia, Intel, en el desarrollo de procesadores para el segmento de mercados espec&iacute;ficos, el procesador Celeron es el nombre que lleva la l&iacute;nea de de bajo costo de Intel. El objetivo fue poder, mediante &eacute;sta segunda marca, penetrar en los mercados impedidos a los Pentium, de mayor rendimiento y precio. Se dise&ntilde;a para a&ntilde;adir valor al segmento del mercado de los PC. Proporcion&oacute; a los consumidores una gran actuaci&oacute;n a un bajo coste, y entreg&oacute; un rendimiento destacado para usos como juegos y el software educativo.</p>
  <p class="Estilo1"><span class="Estilo3">1999: El AMD Athlon K7 (Classic y Thunderbird)</span><a name="1999" id="1999"></a></p>
  <hr />
  <p class="Estilo1"><br />
    Procesador totalmente compatible con la arquitectura x86. Internamente el Athlon es un redise&ntilde;o de su antecesor, pero se le mejor&oacute; substancialmente el sistema de coma flotante (ahora con 3 unidades de coma flotante que pueden trabajar simult&aacute;neamente) y se le increment&oacute; la memoria cach&eacute; de primer nivel (L1) a 128 KB (64 Kb para datos y 64 Kb para instrucciones). Adem&aacute;s incluye 512 Kb de cach&eacute; de segundo nivel (L2). El resultado fue el procesador x86 m&aacute;s potente del momento.</p>
  <p class="Estilo1">El procesador Athlon con n&uacute;cleo Thunderbird apareci&oacute; como la evoluci&oacute;n del Athlon Classic. Al igual que su predecesor, tambi&eacute;n se basa en la arquitectura x86 y usa el bus EV6. El proceso de fabricaci&oacute;n usado para todos estos microprocesadores es de 180 nan&oacute;metros. El Athlon Thunderbird consolid&oacute; a AMD como la segunda mayor compa&ntilde;&iacute;a de fabricaci&oacute;n de microprocesadores, ya que gracias a su excelente rendimiento (superando siempre al Pentium III y a los primeros Pentium IV de Intel a la misma frecuencia de reloj) y bajo precio, la hicieron muy popular tanto entre los entendidos como en los iniciados en la inform&aacute;tica.</p>
  <p class="Estilo1"><span class="Estilo3">1999: El Intel Pentium III</span></p>
  <hr />
  <p class="Estilo1"><br />
    El procesador Pentium III ofrece 70 nuevas instrucciones Internet Streaming, las extensiones de SIMD que refuerzan dram&aacute;ticamente el rendimiento con im&aacute;genes avanzadas, 3D, a&ntilde;adiendo una mejor calidad de audio, video y rendimiento en aplicaciones de reconocimiento de voz. Fue dise&ntilde;ado para reforzar el &aacute;rea del rendimiento en el Internet, le permite a los usuarios hacer cosas, tales como, navegar a trav&eacute;s de p&aacute;ginas pesadas (con muchos gr&aacute;ficos), tiendas virtuales y transmitir archivos video de alta calidad. El procesador se integra con 9,5 millones de transistores, y se introdujo usando en &eacute;l tecnolog&iacute;a 250 nan&oacute;metros.</p>
  <p class="Estilo1"><span class="Estilo3">1999: El Intel Pentium III Xeon</span></p>
  <hr />
  <p class="Estilo1"><br />
    El procesador Pentium III Xeon ampl&iacute;a las fortalezas de Intel en cuanto a las estaciones de trabajo (workstation) y segmentos de mercado de servidores, y a&ntilde;ade una actuaci&oacute;n mejorada en las aplicaciones del comercio electr&oacute;nico e inform&aacute;tica comercial avanzada. Los procesadores incorporan mejoras que refuerzan el procesamiento multimedia, particularmente las aplicaciones de v&iacute;deo. La tecnolog&iacute;a del procesador III Xeon acelera la transmisi&oacute;n de informaci&oacute;n a trav&eacute;s del bus del sistema al procesador, mejorando el rendimiento significativamente. Se dise&ntilde;a pensando principalmente en los sistemas con configuraciones de multiprocesador.</p>
  <p class="Estilo1"><a href="#inicio" class="Estilo8">&lt;</a></p>
  <p class="Estilo1"><span class="Estilo3">2000: EL Intel Pentium 4</span></p>
  <hr />
  <p class="Estilo1"><br />
    Este es un microprocesador de s&eacute;ptima generaci&oacute;n basado en la arquitectura x86 y fabricado por Intel. Es el primero con un dise&ntilde;o completamente nuevo desde el Pentium Pro. Se estren&oacute; la arquitectura NetBurst, la cual no daba mejoras considerables respecto a la anterior P6. Intel sacrific&oacute; el rendimiento de cada ciclo para obtener a cambio mayor cantidad de ciclos por segundo y una mejora en las instrucciones SSE.</p>
  <p class="Estilo1"><span class="Estilo3">2001: El AMD Athlon XP</span></p>
  <hr />
  <p class="Estilo1"><br />
    Cuando Intel sac&oacute; el Pentium 4 a 1,7 GHz en abril de 2001 se vio que el Athlon Thunderbird no estaba a su nivel. Adem&aacute;s no era pr&aacute;ctico para el overclocking, entonces para seguir estando a la cabeza en cuanto a rendimiento de los procesadores x86, AMD tuvo que dise&ntilde;ar un nuevo n&uacute;cleo, y sac&oacute; el Athlon XP. Este compatibilizaba las instrucciones SSE y las 3DNow! Entre las mejoras respecto al Thunderbird se puede mencionar la prerrecuperaci&oacute;n de datos por hardware, conocida en ingl&eacute;s como prefetch, y el aumento de las entradas TLB, de 24 a 32.</p>
  <p class="Estilo1"><span class="Estilo3">2004: El Intel Pentium 4 (Prescott)</span></p>
  <hr />
  <p class="Estilo1"><br />
    A principios de febrero de 2004, Intel introdujo una nueva versi&oacute;n de Pentium 4 denominada &lsquo;Prescott&rsquo;. Primero se utiliz&oacute; en su manufactura un proceso de fabricaci&oacute;n de 90 nm y luego se cambi&oacute; a 65nm. Su diferencia con los anteriores es que &eacute;stos poseen 1 MiB o 2 MiB de cach&eacute; L2 y 16 Kb de cach&eacute; L1 (el doble que los Northwood), prevenci&oacute;n de ejecuci&oacute;n, SpeedStep, C1E State, un HyperThreading mejorado, instrucciones SSE3, manejo de instrucciones AMD64, de 64 bits creadas por AMD, pero denominadas EM64T por Intel, sin embargo por graves problemas de temperatura y consumo, resultaron un fracaso frente a los Athlon 64.</p>
  <p class="Estilo1"><span class="Estilo3">2004: El AMD Athlon 64<a name="2004" id="2004"></a></span></p>
  <hr />
  <p class="Estilo1"><br />
    El AMD Athlon 64 es un microprocesador x86 de octava generaci&oacute;n que implementa el conjunto de instrucciones AMD64, que fueron introducidas con el procesador Opteron. El Athlon 64 presenta un controlador de memoria en el propio circuito integrado del microprocesador y otras mejoras de arquitectura que le dan un mejor rendimiento que los anteriores Athlon y que el Athlon XP funcionando a la misma velocidad, incluso ejecutando c&oacute;digo heredado de 32 bits. El Athlon 64 tambi&eacute;n presenta una tecnolog&iacute;a de reducci&oacute;n de la velocidad del procesador llamada Cool&rsquo;n&rsquo;Quiet,: cuando el usuario est&aacute; ejecutando aplicaciones que requieren poco uso del procesador, baja la velocidad del mismo y su tensi&oacute;n se reduce.</p>
  <p class="Estilo1"><span class="Estilo3">2006: EL Intel Core Duo</span></p>
  <hr />
  <p class="Estilo1"><br />
    Intel lanz&oacute; esta gama de procesadores de doble n&uacute;cleo y CPUs 2&times;2 MCM (m&oacute;dulo Multi-Chip) de cuatro n&uacute;cleos con el conjunto de instrucciones x86-64, basado en la nueva arquitectura Core de Intel. La microarquitectura Core regres&oacute; a velocidades de CPU bajas y mejor&oacute; el uso del procesador de ambos ciclos de velocidad y energ&iacute;a comparados con anteriores NetBurst de los CPU Pentium 4/D2. La microarquitectura Core provee etapas de decodificaci&oacute;n, unidades de ejecuci&oacute;n, cach&eacute; y buses m&aacute;s eficientes, reduciendo el consumo de energ&iacute;a de CPU Core 2, mientras se incrementa la capacidad de procesamiento. Los CPU de Intel han variado muy bruscamente en consumo de energ&iacute;a de acuerdo a velocidad de procesador, arquitectura y procesos de semiconductor, mostrado en las tablas de disipaci&oacute;n de energ&iacute;a del CPU. Esta gama de procesadores fueron fabricados de 65 a 45 nan&oacute;metros.</p>
  <p class="Estilo1"><span class="Estilo3">2007: El AMD Phenom</span></p>
  <hr />
  <p class="Estilo1"><br />
    Phenom fue el nombre dado por Advanced Micro Devices (AMD) a la primera generaci&oacute;n de procesadores de tres y cuatro n&uacute;cleos basados en la microarquitectura K10. Como caracter&iacute;stica com&uacute;n todos los Phenom tienen tecnolog&iacute;a de 65 nan&oacute;metros lograda a trav&eacute;s de tecnolog&iacute;a de fabricaci&oacute;n Silicon on insulator (SOI). No obstante, Intel, ya se encontraba fabricando mediante la m&aacute;s avanzada tecnolog&iacute;a de proceso de 45 nm en 2008. Los procesadores Phenom est&aacute;n dise&ntilde;ados para facilitar el uso inteligente de energ&iacute;a y recursos del sistema, listos para la virtualizaci&oacute;n, generando un &oacute;ptimo rendimiento por vatio. Todas las CPU Phenom poseen caracter&iacute;sticas tales como controlador de memoria DDR2 integrado, tecnolog&iacute;a HyperTransport y unidades de coma flotante de 128 bits, para incrementar la velocidad y el rendimiento de los c&aacute;lculos de coma flotante. La arquitectura Direct Connect asegura que los cuatro n&uacute;cleos tengan un &oacute;ptimo acceso al controlador integrado de memoria, logrando un ancho de banda de 16 Gb/s para intercomunicaci&oacute;n de los n&uacute;cleos del microprocesador y la tecnolog&iacute;a HyperTransport, de manera que las escalas de rendimiento mejoren con el n&uacute;mero de n&uacute;cleos. Tiene cach&eacute; L3 compartida para un acceso m&aacute;s r&aacute;pido a los datos (y as&iacute; no depende tanto del tiempo de latencia de la RAM), adem&aacute;s de compatibilidad de infraestructura de los z&oacute;calos AM2, AM2+ y AM3 para permitir un camino de actualizaci&oacute;n sin sobresaltos. A pesar de todo, no llegaron a igualar el rendimiento de la serie Core 2 Duo.</p>
  <p class="Estilo1"><a href="#inicio" class="Estilo8">&lt;</a></p>
  <p class="Estilo1"><span class="Estilo3">2008: El Intel Core Nehalem</span></p>
  <hr />
  <p class="Estilo1"><br />
    Intel Core i7 es una familia de procesadores de cuatro n&uacute;cleos de la arquitectura Intel x86-64. Los Core i7 son los primeros procesadores que usan la microarquitectura Nehalem de Intel y es el sucesor de la familia Intel Core 2. FSB es reemplazado por la interfaz QuickPath en i7 e i5 (z&oacute;calo 1366), y sustituido a su vez en i7, i5 e i3 (z&oacute;calo 1156) por el DMI eliminado el northBrige e implementando puertos PCI Express directamente. Memoria de tres canales (ancho de datos de 192 bits): cada canal puede soportar una o dos memorias DIMM DDR3. Las placa base compatibles con Core i7 tienen cuatro (3+1) o seis ranuras DIMM en lugar de dos o cuatro, y las DIMMs deben ser instaladas en grupos de tres, no dos. El Hyperthreading fue reimplementado creando n&uacute;cleos l&oacute;gicos. Est&aacute; fabricado a arquitecturas de 45 nm y 32 nm y posee 731 millones de transistores su versi&oacute;n m&aacute;s potente. Se volvi&oacute; a usar frecuencias altas, aunque a contrapartida los consumos se dispararon.</p>
  <p class="Estilo1"><span class="Estilo3">2008: Los AMD Phenom II y Athlon II</span><a name="2008" id="2008"></a></p>
  <hr />
  <p class="Estilo1"><br />
    Phenom II es el nombre dado por AMD a una familia de microprocesadores o CPUs multin&uacute;cleo (multicore) fabricados en 45 nm, la cual sucede al Phenom original y dieron soporte a DDR3. Una de las ventajas del paso de los 65 nm a los 45 nm, es que permiti&oacute; aumentar la cantidad de cach&eacute; L3. De hecho, &eacute;sta se increment&oacute; de una manera generosa, pasando de los 2 MiB del Phenom original a 6 MiB.</p>
  <p class="Estilo1">Entre ellos, el Amd Phenom II X2 BE 555 de doble n&uacute;cleo surge como el procesador bin&uacute;cleo del mercado. Tambi&eacute;n se lanzan tres Athlon II con s&oacute;lo Cach&eacute; L2, pero con buena relaci&oacute;n precio/rendimiento. El Amd Athlon II X4 630 corre a 2,8 GHz. El Amd Athlon II X4 635 continua la misma l&iacute;nea.</p>
  <p class="Estilo1">AMD tambi&eacute;n lanza un triple n&uacute;cleo, llamado Athlon II X3 440, as&iacute; como un doble n&uacute;cleo Athlon II X2 255. Tambi&eacute;n sale el Phenom X4 995, de cuatro n&uacute;cleos, que corre a m&aacute;s de 3,2 GHz. Tambi&eacute;n AMD lanza la familia Thurban con 6 n&uacute;cleos f&iacute;sicos dentro del encapsulado</p>
  <p class="Estilo1"><span class="Estilo3">2011: El Intel Core Sandy Bridge</span></p>
  <hr />
  <p class="Estilo1"><br />
    Llegan para remplazar los chips Nehalem, con Intel Core i3, Intel Core i5 e Intel Core i7 serie 2000 y Pentium G.</p>
  <p class="Estilo1">Intel lanz&oacute; sus procesadores que se conocen con el nombre en clave Sandy Bridge. Estos procesadores Intel Core que no tienen sustanciales cambios en arquitectura respecto a nehalem, pero si los necesarios para hacerlos m&aacute;s eficientes y r&aacute;pidos que los modelos anteriores. Es la segunda generaci&oacute;n de los Intel Core con nuevas instrucciones de 256 bits, duplicando el rendimiento, mejorando el rendimiento en 3D y todo lo que se relacione con operaci&oacute;n en multimedia. Llegaron la primera semana de enero del 2011. Incluye nuevo conjunto de instrucciones denominado AVX y una GPU integrada de hasta 12 unidades de ejecuci&oacute;n</p>
  <p class="Estilo1"><a href="#inicio" class="Estilo8">&lt;</a></p>
  <p class="Estilo1"><span class="Estilo3">2011: El AMD Fusion</span></p>
  <hr />
  <p class="Estilo1"><br />
    AMD Fusion es el nombre clave para un dise&ntilde;o futuro de microprocesadores Turion, producto de la fusi&oacute;n entre AMD y ATI, combinando con la ejecuci&oacute;n general del procesador, el proceso de la geometr&iacute;a 3D y otras funciones de GPUs actuales. La GPU (procesador gr&aacute;fico) estar&aacute; integrada en el propio microprocesador. Se espera la salida progresiva de esta tecnolog&iacute;a a lo largo del 2011; estando disponibles los primeros modelos (Ontaro y Zacate) para ordenadores de bajo consumo entre &uacute;ltimos meses de 2010 y primeros de 2011, dejando el legado de las gamas medias y altas (Llano, Brazos y Bulldozer para mediados o finales del 2011)</p>
  <p class="Estilo1"><span class="Estilo3">2012: El Intel Core Ivy Bridge</span></p>
  <hr />
  <p class="Estilo1"><br />
    Ivy Bridge es el nombre en clave de los procesadores conocidos como Intel Core de tercera generaci&oacute;n. Son por tanto sucesores de los micros que aparecieron a principios de 2011, cuyo nombre en clave es Sandy Bridge. Pasamos de los 32 nan&oacute;metros de ancho de transistor en Sandy Bridge a los 22 de Ivy Bridge. Esto le permite meter el doble de ellos en la misma &aacute;rea. Un mayor n&uacute;mero de transistores significa que puedes poner m&aacute;s bloques funcionales dentro del chip. Es decir, este ser&aacute; capaz de hacer un mayor n&uacute;mero de tareas al mismo tiempo.</p>
  <p class="Estilo1"><span class="Estilo3">2013: El Intel Core Haswell</span><a name="2013" id="2013"></a></p>
  <hr />
  <p class="Estilo1"><br />
    Haswell es el nombre clave de los procesadores de cuarta generaci&oacute;n de Intel Core. Son la correcci&oacute;n de errores de la tercera generaci&oacute;n e implementan nuevas tecnolog&iacute;as gr&aacute;ficas para el gamming y el dise&ntilde;o gr&aacute;fico, funcionando con un menor consumo y teniendo un mejor rendimiento a un buen precio. Continua como su predecesor en 22 nan&oacute;metros pero funciona con un nuevo socket con clave 1150. Tienen un costo elevado a comparaci&oacute;n con los APU&rsquo;s y FX de AMD pero tienen un mayor rendimiento.</p>
  <p class="Estilo1"><span class="Estilo3">2017: El Intel Core i7-7920HQ</span></p>
  <hr />
  <p class="Estilo1"><br />
    Este procesador est&aacute; en la l&iacute;nea de la s&eacute;ptima generaci&oacute;n, incorporando una potencia y una capacidad de respuesta nunca antes vistas. Especialmente fabricado para usuarios exigentes que quieren aumentar su productividad, sin dejar de lado a aquellos que pretenden pensar tambi&eacute;n en el entretenimiento y juegos sensacionales, con alta transferencia de datos y mucho m&aacute;s, ya est&aacute; disponible en el mercado.</p>
  <p class="Estilo1"><a href="#inicio">Inicio</a></p>
</blockquote>
</body>
</html>
