<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
body {
	background-color: #D5FFD5;
}
.Estilo1 {
	font-family: Geneva, Arial, Helvetica, sans-serif;
	font-weight: bold;
	font-size: x-large;
}
.Estilo2 {font-family: Calibri}
.Estilo3 {font-family: Geneva, Arial, Helvetica, sans-serif}
-->
</style></head>

<body>
<blockquote>
  <blockquote>
    <p class="Estilo1">&nbsp;</p>
    <p class="Estilo1">INTEL</p>
    <hr />
    <p class="Estilo3"><strong>Intel Corporation</strong>&nbsp;es el mayor fabricante de&nbsp;circuitos integrados&nbsp;del mundo seg&uacute;n su cifra de negocio anual.&#8203; La compa&ntilde;&iacute;a&nbsp;estadounidense&nbsp;es la creadora de la serie de procesadores&nbsp;x86, los procesadores m&aacute;s com&uacute;nmente encontrados en la mayor&iacute;a de las computadoras personales. Intel fue fundada el 18 de julio de 1968 como&nbsp;Integrated&nbsp;Electronics Corporation (aunque un error com&uacute;n es el de que &quot;Intel&quot; viene de la palabra&nbsp;intelligence) por los pioneros en semiconductores&nbsp;Robert Noyce&nbsp;y&nbsp;Gordon Moore, y muchas veces asociados con la direcci&oacute;n ejecutiva y la visi&oacute;n de&nbsp;Andrew Grove.</p>
    <p class="Estilo3">Dentro de los microprocesadores de Intel se destacan las tecnolog&iacute;as multin&uacute;cleo implementadas en los procesadores&nbsp;Pentium D&nbsp;y&nbsp;Core 2 Duo, la tecnolog&iacute;a m&oacute;vil&nbsp;Centrino&nbsp;desarrollada para el mercado de port&aacute;tiles y la tecnolog&iacute;a&nbsp;HyperThreading&nbsp;integrada en los procesadores&nbsp;Intel Pentium 4&nbsp;y procesadores&nbsp;Intel Core i7. Este procesador reemplaz&oacute; a los procesadores&nbsp;Core 2 Duo. Apenas siendo superado en potencia por la l&iacute;nea Xeon, y los Xeon phi los cuales tienen la capacidad de llegar a los 72 n&uacute;cleos, funcionando a 1,5 GHz. A pesar de todo, estos son los que le han dado su gran fama a Intel, y lo que ha hecho que sus ventas despeguen.</p>
    <p class="Estilo3">Durante los a&ntilde;os 1990, Intel fue responsable de muchas de las innovaciones del hardware de los computadores personales, incluyendo los&nbsp;buses&nbsp;USB,&nbsp;PCI,&nbsp;AGP&nbsp;y&nbsp;PCI-Express. Ejemplos m&aacute;s cercanos son el empleo de la&nbsp;RDRAM&nbsp;de los m&oacute;dulos&nbsp;RIMM&nbsp;y el&nbsp;Slot 1&nbsp;en los&nbsp;Intel Pentium II/Intel Pentium III, medidas tomadas para afianzar el dominio del mercado a golpe de patente, y que se acabaron volviendo en su contra al forzar a sus competidores a innovar y abaratar costes, logrando&nbsp;AMD&nbsp;llevar a buen puerto el primer procesador de 64 bits de la&nbsp;x86-64&nbsp;que adem&aacute;s manten&iacute;a la compatibilidad x86 (mientras que Intel llevaba a&ntilde;os encallado en el&nbsp;Intel Itanium).</p>
    <p class="Estilo3">El principal competidor de Intel en el mercado es Advanced Micro Devices (AMD), empresa con la que Intel tuvo acuerdos de compartici&oacute;n de tecnolog&iacute;a: cada socio pod&iacute;a utilizar las innovaciones tecnol&oacute;gicas&nbsp;patentadas&nbsp;de la otra parte sin ning&uacute;n costo y con la que se ha visto envuelta en pleitos cruzados. El otro hist&oacute;rico competidor en el mercado x86,&nbsp;Cyrix, ha acabado integrado en&nbsp;VIA Technologies, que mantiene el&nbsp;VIA C3&nbsp;en el mercado de los equipos de bajo consumo. Por contra, el auge de los equipos con procesadores con n&uacute;cleo&nbsp;ARM&nbsp;que amenazan devorar la parte m&oacute;vil del mercado PC, se est&aacute; convirtiendo en un rival m&aacute;s serio.</p>
    <p class="Estilo3">En este contexto, a inicios del 2022 intel ha anunciado la 12.&ordf; generaci&oacute;n de sus procesadores en el CES 2022.</p>
    <p class="Estilo3">&nbsp;</p>
	<iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d63623.94215066611!2d-74.11851477832035!3d4.68344750000002!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x8e3f9a96f6dd5b4b%3A0xb35dd2a71430b4c0!2sIntel%20Tecnologia%20de%20Colombia!5e0!3m2!1ses-419!2sco!4v1686146164296!5m2!1ses-419!2sco" width="600" height="450" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>
	<p>
    <h3 class="Estilo3">El Intel 4004, la primera CPU en un chip</h3>
    <p align="center" class="Estilo3"><img src="IMG/4004.jpg" width="409" height="224" /></p>
    <p class="Estilo3">Si mir&aacute;is cualquier libro de historia os dir&aacute;n que la primera CPU que dise&ntilde;aron Gordon Moore y Robert Noyce bajo la marca Intel fue el i4004, el cual est&aacute; considerado la primera CPU completa construida en una sola pieza, ya que antes una CPU sol&iacute;a tener todos sus componentes divididos en varios chips distintos.</p>
    <p class="Estilo3">No obstante, no era el producto estrella de la compa&ntilde;&iacute;a por aquel entonces, ya que su capital ven&iacute;a de la venta de memoria DRAM y SRAM para los miniordenadores de la &eacute;poca. En ese momento no hab&iacute;a ordenadores personales y la memoria de acceso aleatorio era tecnolog&iacute;a punta. Aunque no fueron Noyce y Moore quienes se pusieron en la mesa de dise&ntilde;o para crear el 4004, sino que fue el trabajo de tres ingenieros: Federico Faggin, Ted Hoff, y Stanley Mazor quienes dise&ntilde;aron una CPU de 4 bits completa para Busicom, una empresa de calculadoras electr&oacute;nicas de Jap&oacute;n que le hab&iacute;a comisionado el proyecto a Intel.</p>
    <p class="Estilo3">As&iacute; pues, la que por aquel entonces era una empresa emergente en comparaci&oacute;n con otros gigantes de la &eacute;poca como eran Fairchild Semiconductor o Texas Instruments fue la encargada de crear la primera CPU completa en un chip.</p>
    <h3 class="Estilo3">El Intel 8008 y la terminal de Datapoint</h3>
    <p class="Estilo3">&nbsp;</p>
    <p class="Estilo3">El experimento del i4004 le sirvi&oacute; a Intel para validarse de cara al resto de la industria, pero segu&iacute;an sin ser el gigante en el que se convertir&iacute;an a&ntilde;os m&aacute;s tarde. La era de los PC a&uacute;n no hab&iacute;a llegado y los pocos usuarios de ordenadores continuaban utilizando terminales de tiempo compartido conectadas a un miniordenador, el cual parad&oacute;jicamente pod&iacute;a ser tan grande como una nevera.</p>
    <p class="Estilo3">Una de estas empresas era Datapoint Corporation y su modelo de terminal 2200 ten&iacute;a una particularidad y es que su circuiter&iacute;a no solamente serv&iacute;a como terminal remota, sino que ten&iacute;a un ordenador al completo, ya que pod&iacute;a ejecutar programas gracias al hecho de tener la circuiter&iacute;a integrada de una CPU en su interior. De nuevo a los tres arquitectos encargados del i4004 se les encarg&oacute; el trabajo de reducir toda la compleja circuiter&iacute;a del 8008 que veis arriba de estas im&aacute;genes en el i8008.</p>
    <p class="Estilo3">Desgraciadamente el proyecto con Datapoint no llego a buen puerto y al final las relaciones entre ambas empresas cesaron por completo. Esto no les impidi&oacute; acabar su primera CPU de 8 bits, pero Intel no estaba muy contenta con el resultado.</p>
    <h3 class="Estilo3">El Intel 8080 y el boom de los S-100</h3>
    <p class="Estilo3">El tercer procesador de Intel naci&oacute; de un hecho: el 8008 era demasiado limitado como para utilizarlo y ejecutar programas complejos. Es por ello que Intel se plante&oacute; otro procesador de 8 bits que pudiese tener la capacidad de ejecutar cualquier programa inform&aacute;tico y de ah&iacute; naci&oacute; el i8080.</p>
    <p class="Estilo3">De nuevo Federico Faggin y Stan Mazor volvieron a ponerse manos a la obra, esta vez ayudados por Masatoshi Shima quien ya hab&iacute;a colaborado con ellos en el dise&ntilde;o del 4004. Como curiosidad Faggin abandonar&iacute;a Intel en 1974 para fundar Zilog y crear una versi&oacute;n mejorada en forma del famoso Z80 que fue la CPU central de sistemas como el Spectrum, MSX, Amstrad CPC y muchos otros.</p>
    <p align="center" class="Estilo3"><img src="IMG/s-100.jfif" width="228" height="221" /></p>
    <p class="Estilo3">El 8080 no fue una CPU construida desde cero, sino que se construy&oacute; a partir del dise&ntilde;o del 8008. Mantuvieron el sistema de interrupciones, pero mejoraron el direccionamiento de 16 KB de RAM m&aacute;xima a 64 KB, a&ntilde;adieron m&aacute;s puertos para perif&eacute;ricos e instrucciones nuevas. En cuanto a la velocidad de reloj esta subi&oacute; de 0,5 MHz hasta los 2 MHz, por lo que era cuatro veces m&aacute;s r&aacute;pido que su antecesor.</p>
    <p class="Estilo3">El tercer procesador de Intel naci&oacute; de un hecho: el 8008 era demasiado limitado como para utilizarlo y ejecutar programas complejos. Es por ello que Intel se plante&oacute; otro procesador de 8 bits que pudiese tener la capacidad de ejecutar cualquier programa inform&aacute;tico y de ah&iacute; naci&oacute; el i8080.</p>
    <p class="Estilo3">De nuevo Federico Faggin y Stan Mazor volvieron a ponerse manos a la obra, esta vez ayudados por Masatoshi Shima quien ya hab&iacute;a colaborado con ellos en el dise&ntilde;o del 4004. Como curiosidad Faggin abandonar&iacute;a Intel en 1974 para fundar Zilog y crear una versi&oacute;n mejorada en forma del famoso Z80 que fue la CPU central de sistemas como el Spectrum, MSX, Amstrad CPC y muchos otros.</p>
    <p class="Estilo3">El 8080 no fue una CPU construida desde cero, sino que se construy&oacute; a partir del dise&ntilde;o del 8008. Mantuvieron el sistema de interrupciones, pero mejoraron el direccionamiento de 16 KB de RAM m&aacute;xima a 64 KB, a&ntilde;adieron m&aacute;s puertos para perif&eacute;ricos e instrucciones nuevas. En cuanto a la velocidad de reloj esta subi&oacute; de 0,5 MHz hasta los 2 MHz, por lo que era cuatro veces m&aacute;s r&aacute;pido que su antecesor.</p>
    <h3 class="Estilo3">El 80286, el salto en IPC m&aacute;s grande de una CPU x86</h3>
    <p align="center" class="Estilo3"><img src="IMG/intel 80286.jfif" width="264" height="191" /></p>
    <p class="Estilo3">El &eacute;xito del IBM PC fue abrumador, ya en 1984 se hab&iacute;a convertido en la plataforma por antonomasia como ordenador personal para negocios en todo el mundo, pero hac&iacute;a falta la creaci&oacute;n de una versi&oacute;n m&aacute;s r&aacute;pida que lleg&oacute; con la creaci&oacute;n del PC AT y esta vez s&iacute; que IBM en total confianza con Intel le pidi&oacute; que hiciera una nueva CPU totalmente compatible hacia atr&aacute;s a nivel de binarios, pero mucho m&aacute;s r&aacute;pida.</p>
    <p class="Estilo3">El 80286 fue el salto en IPC m&aacute;s grande que se ha hecho en la historia de las CPU de Intel, ya que por ciclo de reloj su rendimiento era m&aacute;s del doble que el del 8086. Para conseguirlo se mejoraron sus buses internos que dejaron de estas multiplexados, se optimiz&oacute; el proceso de captaci&oacute;n de instrucciones y la funcionalidad de las de salto fueron mejoradas. Adem&aacute;s, Intel incluy&oacute; por primera vez una MMU, la cual funcionaba por segmentos.</p>
    <p class="Estilo3">Como curiosidad, se trata de la CPU m&aacute;s longeva para PC de la historia, ya que incluso en 1990 se pod&iacute;an encontrar ordenadores a la venta con dicha CPU.</p>
    <h3 class="Estilo3">Por fin los 32 bits, el 80386</h3>
    <p class="Estilo3">El 80386 no fue la primera CPU la historia de Intel de 32 bits, sino que el iAPX 432 tiene el honor de serlo, no obstante, cuando lleg&oacute; el momento de crear una versi&oacute;n de 32 bits del 8086 Intel cogi&oacute; muchos conceptos de dicho proyecto, aunque el mayor desaf&iacute;o era trasladar el c&oacute;digo. &iquest;La soluci&oacute;n? Utilizar los mismos registros, pero extendidos en tama&ntilde;o hasta los 32 bits. Adem&aacute;s, el 80386 fue la primera CPU de la historia de Intel con un pipeline segmentado, el cual fue de tres etapas.</p>
    <p class="Estilo3">Aunque el gran desaf&iacute;o ten&iacute;a que ver con la multitarea, la idea de tener un procesador que permitirse hacer funcionar en un ordenador personal o una estaci&oacute;n de trabajo un sistema operativo capaz de ejecutar varios programas a la vez. Para ello dise&ntilde;aron una nueva MMU, esta vez soportando memoria virtual por paginaci&oacute;n, m&eacute;todo que se utiliza a d&iacute;a de hoy.</p>
    <p class="Estilo3">Gracias a esta CPU el PC dio un salto de calidad como plataforma, ya que trajo las novedades que permitieron que Windows a partir de su tercera versi&oacute;n dejase de ser un chiste, as&iacute; como Linux y sobre todo marc&oacute; el dominio del PC por encima de otras plataformas.</p>
    <h3 class="Estilo3">El Intel Pentium, la primera CPU multimedia de la historia</h3>
    <p class="Estilo3">El Intel Pentium fue la primera CPU superescalar bajo ISA x86, el cual trajo consigo la capacidad de ejecutar 2 instrucciones en paralelo y al mismo tiempo. Gracias a ello el IPC respecto al 80486 mejor&oacute; en un 40% en el proceso.</p>
    <p align="center" class="Estilo3"><img src="IMG/pentium.jpg" width="285" height="230" /></p>
    <p class="Estilo3">A&ntilde;os m&aacute;s tarde, Intel lanz&oacute; el Pentium MMX, el cual hac&iacute;a un cambio en la unidad de coma flotante, ya que implementaba el SIMD sobre registro en la misma para acelerar as&iacute; los incipientes programas multimedia de la &eacute;poca. Pero la vida comercial de los Pentium MMX fue corta, ya que en 1997 cuando fueron lanzados coincidieron en el mercado junto al Pentium II, justo un a&ntilde;o despu&eacute;s que la versi&oacute;n mejorada de la CPU x86 de quinta generaci&oacute;n de Intel</p>
    <p class="Estilo3">A nivel de arquitectura los cambios eran menores respecto al 80486, pero el dise&ntilde;o volvi&oacute; de nuevo a las manos de los que hab&iacute;an creado el 80386 original quienes terminaron el dise&ntilde;o en 1992. Fuera de su dise&ntilde;o superescalar fue muy conservador, al fin y al cabo, la empresa hab&iacute;a dejado de tener competencia, no obstante, esto no significaba que se hubieran quedado de brazos cruzados.</p>
    <h3 class="Estilo3"><strong>Pentium 4, el final de una era</strong></h3>
    <p align="center" class="Estilo3"><img src="IMG/pentium 4.jpg" width="300" height="189" /></p>
    <p class="Estilo3">Para el Pentium 4, Intel cre&oacute; una nueva arquitectura llamada Netburst, la cual sigui&oacute; la tendencia de la &eacute;poca de a&ntilde;adir una gran cantidad de etapas para alcanzar una gran velocidad de reloj. Fue con este procesador que Intel se dio contra el techo de las velocidades y se descubri&oacute; que la carrera basada en esa m&eacute;trica no ten&iacute;a futuro, debido al alto consumo de los procesadores y la temperatura que generaban.</p>
    <p class="Estilo3">Fue por la experiencia del Pentium 4 que la m&eacute;trica &laquo;potencia por vatio&raquo; pas&oacute; a tener importancia y se empezaron a dise&ntilde;ar CPU ya basadas en el concepto multin&uacute;cleo. En especial el motivo fue porque eran inviables para ser montados en ordenadores port&aacute;tiles y hab&iacute;an tenido que alargar la vida de los P6 para poder lanzar CPU para ese tipo de ordenadores que por aquel entonces estaba en ciernes.</p>
    <p class="Estilo3">Las malas lenguas dicen que fue una tal Apple, obsesionada con sus dise&ntilde;os industriales la que le hizo un pulso a Intel sobre si pod&iacute;a crear un n&uacute;cleo con el suficiente rendimiento por vatio y con m&aacute;s potencia que los PowerPC, solo entonces dar&iacute;a el salto a los x86. Y as&iacute; fue, pero con ello tambi&eacute;n abandonaron el nombre Pentium para adoptar otro.</p>
    <h3 class="Estilo3">La era multin&uacute;cleo de la historia de Intel </h3>
    <p class="Estilo3">Los primeros Intel Core se basaban en la arquitectura P6, pero con una configuraci&oacute;n de doble n&uacute;cleo. No obstante, hab&iacute;an desarrollado una segunda generaci&oacute;n que fue revolucionaria y que est&aacute; considerada como la mejor CPU de la d&eacute;cada de los 2000.</p>
    <p class="Estilo3">Para su desarrollo Intel copio varias ideas a los Opteron de AMD; como es la implementaci&oacute;n del Northbridge dentro del procesador y la adopci&oacute;n de la extensi&oacute;n a 64 bits del x86. En cuanto a rendimiento casi duplicaron el IPC y se trata del tercer salto de rendimiento m&aacute;s grande despu&eacute;s del conseguido con el 80286 y el 80486. Para ello mejoraron la ejecuci&oacute;n fuera de orden, hicieron que la CPU fuese capaz de manejar m&aacute;s instrucciones en paralelo y a&ntilde;adieron por primera vez la Smart Cache en los procesadores Intel.</p>
    <p class="Estilo3">&nbsp;</p>
    <p class="Estilo3">&nbsp;</p>
    <p class="Estilo3">&nbsp;</p>
    <p class="Estilo3">&nbsp;</p>
    <p class="Estilo3">&nbsp;</p>
    <p class="Estilo3">&nbsp;</p>
    <p class="Estilo3">&nbsp;</p>
    <p class="Estilo1">&nbsp;</p>
  </blockquote>
</blockquote>
</body>
</html>
