<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
body {
	background-color: #D5FFD5;
}
.Estilo1 {
	font-family: Geneva, Arial, Helvetica, sans-serif;
	font-weight: bold;
	font-size: x-large;
}
.Estilo2 {font-family: Geneva, Arial, Helvetica, sans-serif}
-->
</style></head>

<body>
<blockquote>
  <blockquote>
    <p class="Estilo1">&nbsp;</p>
    <p class="Estilo1">QUALCOMM</p>
    <hr />
    <p class="Estilo2" data-mrf-recirculation="Article links">Durante la&nbsp;primera parte&nbsp;de la&nbsp;<strong>historia de Qualcomm</strong>, vimos c&oacute;mo de una gran amistad fraguada durante la &eacute;poca universitaria, hab&iacute;a nacido esta empresa, que ahora se ha convertido en el primer fabricante de semiconductores para m&oacute;viles del mundo.</p>
    <p class="Estilo2" data-mrf-recirculation="Article links">Repasamos entonces toda la&nbsp;<strong>trayectoria de la compa&ntilde;&iacute;a durante la &uacute;ltima parte del Siglo XX</strong>, desde la llamada que lo cambi&oacute; todo, la llegada de Internet a las comunicaciones m&oacute;viles, el primer smartphone, los chipsets y el aterrizaje de la tecnolog&iacute;a multimedia en los tel&eacute;fonos. En esta segunda parte vamos conocer el resto de la historia hasta llegar a nuestros d&iacute;as.</p>
    <h2 class="Estilo2">Banda ancha inal&aacute;mbrica</h2>
    <p class="Estilo2" data-mrf-recirculation="Article links">En mayo de 2003, Qualcomm anuncia su cuarta generaci&oacute;n de chips&nbsp;WCDMA. La soluci&oacute;n ofrece&nbsp;<em>Speed &#8203;&#8203;Downlink Packet Access</em>&nbsp;(HSDPA), una caracter&iacute;stica de pr&oacute;xima generaci&oacute;n de la norma WCDMA (UMTS), as&iacute; como la itinerancia (roaming) en los sistemas&nbsp;GSM&nbsp;y&nbsp;GPRS.</p>
    <p class="Estilo2" data-mrf-recirculation="Article links">Adem&aacute;s, la nueva soluci&oacute;n ofrece&nbsp;<strong>tel&eacute;fonos WCDMA con funcionalidad multimedia mejorada</strong>&nbsp;para videoconferencia, transmisi&oacute;n de v&iacute;deo en streaming, reproducci&oacute;n de m&uacute;sica, juegos, y caracter&iacute;sticas de c&aacute;mara fotogr&aacute;fica y videoc&aacute;mara.</p>
    <p class="Estilo2" data-mrf-recirculation="Article links">En septiembre de 2003,&nbsp;<em>Verizon Wireless</em>&nbsp;lanza servicios&nbsp;CDMA2000 1xEV-DO&nbsp;en su red nacional en EE.UU., ofreciendo a sus clientes conectividad de datos a velocidades de banda ancha.</p>
    <h2 class="Estilo2">Procesador Scorpio</h2>
    <p align="center" class="Estilo2"><img src="IMG/SCORPIO.png" width="450" height="244" /></p>
    <p class="Estilo2" data-mrf-recirculation="Article links">En noviembre de 2005, Qualcomm present&oacute; el procesador Scorpion, un microprocesador m&oacute;vil avanzado que entrega una&nbsp;<strong>velocidad de procesamiento de 1 GHz, con una eficiencia energ&eacute;tica sin igual</strong>.</p>
    <p class="Estilo2" data-mrf-recirculation="Article links">El n&uacute;cleo Scorpion es el primer microprocesador espec&iacute;ficamente dise&ntilde;ado y optimizado para ser integrado en la gama&nbsp;<em>Mobile Station Modem</em>&nbsp;(MSM) de Qualcomm, permitiendo la convergencia de los tel&eacute;fonos m&oacute;viles con funciones de electr&oacute;nica de consumo.</p>
    <p class="Estilo2" data-mrf-recirculation="Article links">Scorpion es la generaci&oacute;n de arquitectura de CPU propia de Qualcomm anterior a la que se utiliza actualmente, la arquitectura Krait.</p>
    <h2 class="Estilo2">Procesador Snapdragon</h2>
    <p align="center" class="Estilo2"><img src="IMG/SNAP.jpg" width="365" height="243" /></p>
    <p class="Estilo2">En noviembre de 2007, Qualcomm presenta la plataforma Snapdragon y dos soluciones de chipset que ofrece la plataforma para&nbsp;<strong>romper la barrera del gigahercio con banda ancha multimodo y funciones multimedia</strong>, ofreciendo una combinaci&oacute;n sin precedentes en inform&aacute;tica m&oacute;vil, de rendimiento multimedia, conectividad inal&aacute;mbrica 3G y un nivel de consumo de energ&iacute;a realmente bajo.</p>
    <h2 class="Estilo2">Primer tel&eacute;fono con Android</h2>
    <p class="Estilo2">El primer tel&eacute;fono con Android, T-Mobile G1, fue fabricado por HTC, con un chipset Qualcomm. Ambas compa&ntilde;&iacute;as trabajaron de forma conjunta en el dise&ntilde;o y desarrollo del primer dispositivo basado en Android.<strong>&nbsp;T-Mobile G1 fue construido en torno al chip MSM7201A, que integraba dos n&uacute;cleos</strong>.</p>
    <h2 class="Estilo2">El &eacute;xito de la tecnolog&iacute;a 3G</h2>
    <p class="Estilo2" data-mrf-recirculation="Article links">Estamos ya en 2009. Qualcomm hab&iacute;a presentado en febrero la&nbsp;<strong>primera soluci&oacute;n que integraba 3G / LTE</strong>. El chipset, denominado MSM8960, soportaba todos los est&aacute;ndares de banda ancha m&oacute;vil m&aacute;s importantes.</p>
    <p class="Estilo2" data-mrf-recirculation="Article links">Ese mismo a&ntilde;o, el n&uacute;mero de usuarios de tecnolog&iacute;a CDMA hab&iacute;a superado la cifra de 500.000 en todo el mundo. Un a&ntilde;o despu&eacute;s, en abril, el n&uacute;mero de usuarios conectados con&nbsp;<strong>tecnolog&iacute;a 3G superaba los mil millones</strong>.</p>
    <h2 class="Estilo1">Snapdragon de dos y cuatro n&uacute;cleos</h2>
    <p class="Estilo2" data-mrf-recirculation="Article links">Qualcomm present&oacute; los primeros procesadores&nbsp;<strong>Snapdragon de doble n&uacute;cleo en 2010</strong>, con velocidades que llegaban hasta los 1,2 GHz. Lo siguiente ya lo sab&eacute;is, este a&ntilde;o la compa&ntilde;&iacute;a ha dado a conocer la siguiente generaci&oacute;n de Snapdragon, con&nbsp;<strong>cuatro n&uacute;cleos funcionando a 2,3 GHz</strong>.</p>
    <p class="Estilo2" data-mrf-recirculation="Article links">Ha sido un largo camino el recorrido por aquellos dos estudiantes que se conocieron en la universidad. La siguiente generaci&oacute;n&nbsp;<strong>ha tomado el relevo en 2010</strong>. Ahora que millones de personas estamos conectadas en el mundo con aparatos que caben en la palma de la mano, cuesta creer que las primeras ideas para que esto haya sido posible partieran de s&oacute;lo dos visionarios:&nbsp;<strong>Irwin Jacobs y Andrew Viterbi</strong>.</p>
    <p class="Estilo2">&nbsp;</p>
    <p class="Estilo2">&nbsp;</p>
    <p class="Estilo2" data-mrf-recirculation="Article links">&nbsp;</p>
    <p class="Estilo2" data-mrf-recirculation="Article links">&nbsp;</p>
    <p class="Estilo1">&nbsp;</p>
  </blockquote>
</blockquote>
</body>
</html>
