<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
body {
	background-color: #D5FFD5;
}
.Estilo3 {font-family: Geneva, Arial, Helvetica, sans-serif}
.Estilo4 {
	font-family: Geneva, Arial, Helvetica, sans-serif;
	font-size: xx-large;
	font-weight: bold;
}
-->
</style></head>

<body>
<blockquote>
  <blockquote>
    <p class="Estilo4">&nbsp;</p>
    <p class="Estilo4">AMD</p>
    <hr />
    <p class="Estilo3"><strong>Advanced Micro Devices o tambi&eacute;n conocida como</strong>&nbsp;AMD es una compa&ntilde;&iacute;a de semiconductores con sede en Sunnyvale, California, que se dedica al desarrollo de procesadores, chipsets para placas base, circuitos integrados auxiliares, procesadores embebidos, tarjetas gr&aacute;ficas y productos tecnol&oacute;gicos relacionados para el mercado de consumo. AMD es el segundo fabricante a nivel mundial de procesadores x86, y el segundo fabricante de tarjetas gr&aacute;ficas para el sector profesional y el dom&eacute;stico. </p>
    <p><img src="IMG/amd.gif" width="600" height="337" /></p>
    <h2 class="Estilo3">El nacimiento de AMD y la historia de sus procesadores </h2>
    <p class="Estilo3">AMD fue fundada el 1 de mayo de 1969&nbsp;por un grupo de ejecutivos de Fairchild Semiconductor, entre ellos se encontraban Jerry Sanders III, Edwin Turney, John Carey, Steven Simonsen, Jack Gifford, Frank Botte, Jim Giles y Larry Stenger. AMD se estren&oacute; en el mercado de los circuitos integrados l&oacute;gicos, para dar el salto a las memorias RAM en 1975. AMD&nbsp;siempre ha destacado por ser el eterno rival de Intel, actualmente son las dos &uacute;nicas compa&ntilde;&iacute;as que venden procesadores x86, aunque VIA est&aacute; empezando a meter la patita de nuevo en esta arquitectura.</p>
    <h3 class="Estilo3">AMD 9080, el comienzo de la aventura de AMD</h3>
    <p align="center" class="Estilo3"><img src="IMG/AMD-9080.jpg" width="405" height="226" /></p>
    <p class="Estilo3">Su primer procesador fue el AMD 9080, una copia del Intel 8080 que fue creada mediante t&eacute;cnicas de ingenier&iacute;a inversa. Tas &eacute;l llegaron otros modelos como los Am2901, Am29116, Am293xx usados en varios dise&ntilde;os de microcomputadores.&nbsp;El siguiente salto lo representaron los AMD 29k, que buscaban destacar por la inclusi&oacute;n de unidades gr&aacute;ficas, de video y memorias EPROM, y los AMD7910 y AMD7911, que fueron los primeros en soportar&nbsp;<em>varios&nbsp;</em>est&aacute;ndares tanto Bell como CCITT en 1200 baudios half duplex o 300/300 full d&uacute;plex. Tras ello, AMD decide centrarse &uacute;nicamente en los microprocesadores compatibles con Intel, lo que convierte a la compa&ntilde;&iacute;a en competencia directa. </p>
    <p class="Estilo3">AMD firma un contrato con Intel en 1982 para licenciar la fabricaci&oacute;n de procesadores x86, una arquitectura que es propiedad de Intel, por lo que necesita del permiso de esta para poder fabricarlos. Esto le&nbsp;permiti&oacute; a AMD ofrecer procesadores muy competentes y hacer competencia directa a Intel, qui&eacute;n cancel&oacute; el contrato en 1986, neg&aacute;ndose a revelar detalles t&eacute;cnicos del i386. AMD apel&oacute; contra Intel y gan&oacute; la batalla legal, con la Suprema Corte de California forzando a Intel a pagar m&aacute;s de 1000 millones de d&oacute;lares en compensaci&oacute;n por violaci&oacute;n de contrato. Las disputas legales siguieron y&nbsp;AMD se vi&oacute; forzada a desarrollar versiones limpias del c&oacute;digo de Intel, lo que significaba que ya no pod&iacute;a seguir clonando los procesadores de Intel, al menos de forma directa.</p>
    <p class="Estilo3">Tras esto, AMD tuvo que poner a trabajar dos equipos independientes, uno destripando los secretos de los chips de AMD, y el otro creando sus propias equivalencias.&nbsp;Am386 fue el primer procesador de esta nueva era de AMD, un modelo que llegaba para luchar contra el Intel 80386, y que logr&oacute; vender m&aacute;s de un mill&oacute;n de unidades en menos de un a&ntilde;o.&nbsp;Tras &eacute;l llegaron el 386DX-40 y el Am486 que fue utilizado en numerosos equipos OEM probando su popularidad. AMD se dio cuenta de que deb&iacute;a dejar de seguir los pasos de Intel o siempre estar&iacute;a a su sombra, adem&aacute;s de que cada vez era m&aacute;s complicado por la gran complejidad de los nuevos modelos.</p>
    <p class="Estilo3">El 30 de diciembre de 1994, la Suprema Corte de California neg&oacute; a AMD el derecho de usar el microc&oacute;digo de i386. Tras ello, se permiti&oacute; a AMD producir y vender microprocesadores con microc&oacute;digo de Intel 286, 386, y 486.</p>
    <h3 class="Estilo3">AMD K5 y K6, una nueva era para AMD</h3>
    <p align="center" class="Estilo3"><img src="IMG/K5.jpg" width="235" height="218" /></p>
    <p class="Estilo3">AMD K5 fue el primer procesador creado por la compa&ntilde;&iacute;a desde sus cimientos y sin nada de c&oacute;digo de Intel en su interior.&nbsp;Tras este lleg&oacute; el AMD K6 y el AMD K7, el primero de la marca Athlon que lleg&oacute; al mercado el 23 de junio de 1999. Este AMD K7 necesitaba de nuevas placas base, pues hasta el momento era posible montar procesadores tanto de Intel como de AMD en la misma placa base.&nbsp;Con ello nace el Socket A, el primero exclusivo para procesadores de AMD. El 9 de octubre de 2001 lleg&oacute; el Athlon XP y el Athlon XP el 10 de febrero de 2003.</p>
    <p class="Estilo3">AMD sigui&oacute; innovando con su procesador K8, una gran revisi&oacute;n de la anterior arquitectura K7 que a&ntilde;ade las extensiones de 64 bit al conjunto de instrucciones x86. Esto supone un intento por parte de AMD de definir el est&aacute;ndar x64 e imponerse a los est&aacute;ndares marcados por Intel. En otras palabras,&nbsp;AMD es la madre de la extensi&oacute;n x64, la cual usan todos los procesadores x86 de la actualidad. AMD consigui&oacute; dar un giro a la historia y Microsoft adopt&oacute; el conjunto de instrucciones de AMD, dejando a Intel el trabajo de ingenier&iacute;a inversa de las especificaciones de AMD. AMD lograba por primera vez colocarse por delante de Intel.</p>
    <p class="Estilo3">AMD se marc&oacute; otro tanto ante Intel con la introducci&oacute;n del Athlon 64 X2 en 2005, el primer procesador de doble n&uacute;cleo para PC. La principal ventaja de este procesador es que contiene dos n&uacute;cleos basados en K8, y puede procesar varias tareas a la vez rindiendo mucho mejor que los procesadores de un solo n&uacute;cleo. Este procesador&nbsp;sent&oacute; las bases para la creaci&oacute;n de los procesadores actuales, con hasta 32 n&uacute;cleos en su interior.&nbsp;AMD Turion 64 es una versi&oacute;n de bajo consumo destinada a los ordenadores port&aacute;tiles, para competir contra la tecnolog&iacute;a Centrino de Intel. &nbsp;Por desgracia para AMD, su liderazgo acab&oacute; en 2006 con la llegada de los Intel Core 2 Duo.</p>
    <h3 class="Estilo3">AMD Phenom, su primer procesador de cuatro n&uacute;cleos</h3>
    <p align="center" class="Estilo3"><img src="IMG/AMD-Phenom.jpg" width="450" height="265" /></p>
    <p class="Estilo3"><strong>En noviembre de 2006 AMD anuncia el desarrollo de su nuevo procesador Phenom, que ser&iacute;a lanzado a mediados del 2007.</strong> Este nuevo procesador se basa en la mejorada arquitectura K8L, y llega como un intento de AMD por alcanzar a una Intel que se hab&iacute;a vuelto a poner por delante con la llegada de los Core 2 Duo en 2006.&nbsp;Ante el nuevo dominio de Intel, AMD tuvo que redise&ntilde;ar su tecnolog&iacute;a y dar el salto a los 65nm y a los procesadores de cuatro n&uacute;cleos.</p>
    <p class="Estilo3">En 2008 llegaron los Athlon II y Phenom II fabricados en 45nm, los cuales segu&iacute;an haciendo uso de la&nbsp;misma arquitectura b&aacute;sica K8L. El siguiente paso fue dado con los Phenom II X6, lanzados en el a&ntilde;o 2010 y con una configuraci&oacute;n de seis n&uacute;cleos para intentar plantar cara a los modelos de cuatro n&uacute;cleos de Intel.</p>
    <h3 class="Estilo3">AMD Fusion,&nbsp;AMD Bulldozer y AMD Vishera</h3>
    <p class="Estilo3">La compra de ATI por parte de AMD puso a esta &uacute;ltima en una posici&oacute;n privilegiada, pues era la &uacute;nica compa&ntilde;&iacute;a que dispon&iacute;a de CPUs y GPUs de alto rendimiento. Con ello naci&oacute; el proyecto Fusion, que ten&iacute;a la intenci&oacute;n de unir el procesador y la tarjeta gr&aacute;fica en un &uacute;nico chip. Fusion introduce la necesidad de integrar un mayor n&uacute;mero de elementos dentro del procesador, como un v&iacute;nculo PCI Express de 16 carriles para acomodar perif&eacute;ricos externos, esto elimina completamente la necesidad de un northbridge en la placa base.</p>
    <div>
    <div id="lx_681915" data-cnt="9" data-original-id="684984" data-base-original-id="684983">
    <div align="center"><img src="IMG/AMD-FX.jpg" width="325" height="264" /></div>
    <p class="Estilo3">AMD Llano fue el producto del proyecto Fusi&oacute;n, el primer procesador de AMD con un n&uacute;cleo gr&aacute;fico integrado. Intel se hab&iacute;a adelantado en la integraci&oacute;n con sus Westmere, pero los gr&aacute;ficos de AMD eran muy superiores, y los &uacute;nicos que permit&iacute;an jugar a juegos 3D avanzados. Este procesador&nbsp;se basa en los mismos n&uacute;cleos K8L que los anteriores, y supuso el estreno de AMD con el proceso de fabricaci&oacute;n a 32 nm.</p>
    <p class="Estilo3">El relevo del n&uacute;cleo K8L lleg&oacute; finalmente de la mano de Bulldozer en 2011, una nueva arquitectura K10 fabricada a 32 nm, y enfocada a ofrecer un alto n&uacute;mero de n&uacute;cleos.&nbsp;Bulldozer hace que los n&uacute;cleos compartan elementos por cada dos de ellos, lo que permite ahorrar espacio en el silicio, y ofrecer un mayor n&uacute;mero de n&uacute;cleos.&nbsp;Las aplicaciones multi-n&uacute;cleo eran el futuro, por lo que AMD intent&oacute; hacer una gran innovaci&oacute;n para ponerse por delante de Intel.</p>
    <p class="Estilo3">Desafortunadamente, el rendimiento de Bulldozer un fue el esperado, pues cada uno de estos n&uacute;cleos era mucho m&aacute;s d&eacute;bil que los Sandy Bridge de Intel, por lo que, pese a que AMD ofrec&iacute;a el doble de n&uacute;cleos, Intel segu&iacute;a dominando con cada vez m&aacute;s fuerza.&nbsp;Tampoco ayud&oacute; el que el software segu&iacute;a sin poder aprovechar de forma eficiente m&aacute;s de cuatro n&uacute;cleos, lo que iba a ser la ventaja de Bulldozer acabo siendo su mayor debilidad. Vishera llego en 2012 como una evoluci&oacute;n de Bulldozer, aunque Intel estaba cada vez m&aacute;s lejos.</p>
    <h2 class="Estilo3">Procesadores actuales de AMD</h2>
    <p class="Estilo3">Los procesadores actuales de AMD est&aacute;n basados todos ellos en distintas generaciones de la arquitectura Zen,&nbsp;basados en los procesos de 14nm/12nm de Global Foundries,&nbsp;o los 7nm de TSMC. El nombre Zen se debe a una filosof&iacute;a budista originada en China en el siglo VI, esta filosof&iacute;a predica la meditaci&oacute;n con el fin de conseguir la iluminaci&oacute;n que revela la verdad. Tras el fracaso de la arquitectura Bulldozer, AMD entro en un periodo de meditaci&oacute;n sobre lo que deber&iacute;a ser su pr&oacute;xima arquitectura, esto fue lo que dio lugar al nacimiento de la arquitectura Zen.&nbsp;Ryzen es el nombre comercial de los procesadores basados en esta arquitectura, un nombre que hace referencia al resurgir de AMD. Estos procesadores fueron lanzados el pasado a&ntilde;o 2017, todos ellos funcionan con el socket AM4.</p>
    <p class="Estilo3">Todos los procesadores Ryzen incluyen la&nbsp;<strong>tecnolog&iacute;a SenseMI</strong>, que ofrece las siguientes caracter&iacute;sticas:</p>
    <ul>
      <li class="Estilo3"><strong>Pure Power</strong>: se encarga de optimizar el uso de la energ&iacute;a teniendo en cuenta las temperaturas de cientos de sensores, lo que permite repartir la carga de trabajo sin sacrificar el desempe&ntilde;o.</li>
      <li class="Estilo3"><strong>Precision Boost</strong>: esta tecnolog&iacute;a aumenta el voltaje y la velocidad de reloj de forma precisa en saltos de 25 Mhz, esto permite optimizar la cantidad de energ&iacute;a consumida y ofrecer las frecuencias m&aacute;s altas posibles.</li>
      <li class="Estilo3"><strong>XFR</strong>&nbsp;<strong>(eXtended Frequency Range)</strong>: funciona junto a Precision Boost para aumentar el voltaje y la velocidad por encima del m&aacute;ximo permitido por Precision Boost, siempre que la temperatura de funcionamiento no sobrepase el umbral cr&iacute;tico.</li>
      <li class="Estilo3"><strong>Neural Net Prediction y Smart Prefetch</strong>: utilizan t&eacute;cnicas de inteligencia artificial para optimizar el flujo de trabajo y la administraci&oacute;n de la cach&eacute; con una carga previa de los datos de informaci&oacute;n inteligente, esto optimiza el acceso a la memoria RAM.</li>
    </ul>
    <h3 class="Estilo3">&nbsp;</h3>
    <p class="Estilo3">&nbsp;</p>
  </blockquote>
</blockquote>
<p>&nbsp; </p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp; </p>
</body>
</html>
