<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
body {
	background-color: #D5FFD5;
}
.Estilo1 {font-family: Arial, Helvetica, sans-serif}
.Estilo2 {font-family: Geneva, Arial, Helvetica, sans-serif}
-->
</style></head>

<body>
<blockquote>
  <blockquote>
    <h2 class="Estilo1" id="qu-es-un-cpu">&nbsp;</h2>
    <h2 class="Estilo1">&iquest;Qu&eacute; es un CPU?</h2>
    <hr />
      <p class="Estilo1">&nbsp;</p>
    <p class="Estilo1">CPU&nbsp;es la&nbsp;<strong>abreviaci&oacute;n de&nbsp;<em>Unidad Central de Procesamiento</em></strong>, un&nbsp;componente&nbsp;b&aacute;sico de todo dispositivo que procesa&nbsp;datos&nbsp;y realiza c&aacute;lculos&nbsp;matem&aacute;ticos-inform&aacute;ticos.</p>
    <p class="Estilo1">El CPU proporciona la capacidad de&nbsp;programaci&oacute;n&nbsp;y, junto con la&nbsp;memoria&nbsp;y los&nbsp;dispositivos de entrada/salida, es uno de los componentes presentes en la&nbsp;historia de los ordenadores.<strong>&nbsp;Con el tiempo, los&nbsp;microprocesadores&nbsp;de un chip fueron reemplazando a los CPU,</strong>&nbsp;usualmente cuando se hace referencia a este t&eacute;rmino se habla de los&nbsp;microprocesadores.</p>
    <p class="Estilo1">Algunas de las funciones b&aacute;sicas del CPU son recolectar&nbsp;informaci&oacute;n, decodificarla en partes menores y llevar a cabo instrucciones, que luego ejecuta.</p>
    <p><span class="Estilo1"><br />
    </span>  </p>
    <h2 class="Estilo1" id="para-qu-sirve-un-cpu">&iquest;Para qu&eacute; sirve un CPU?</h2>
    <hr />
      <p>&nbsp;</p>
    <p class="Estilo1">El CPU es la pieza fundamental de todo dispositivo, es considerado el cerebro de un sistema.</p>
    <p class="Estilo1">En primer lugar,&nbsp;<strong>es el encargado de recibir e interpretar datos y ejecutar las secuencias de instrucciones</strong>&nbsp;a realizar por cada&nbsp;programa&nbsp;vali&eacute;ndose de operaciones aritm&eacute;ticas y matem&aacute;ticas. El CPU interpreta todos los datos que provienen del dispositivo, tanto de los programas como la informaci&oacute;n que env&iacute;a el&nbsp;usuario&nbsp;a trav&eacute;s de aplicaciones.</p>
    <p class="Estilo1">Adem&aacute;s,&nbsp;<strong>controla el buen funcionamiento de cada componente del sistema&nbsp;</strong>para que todas las acciones sean realizadas en tiempo y forma.</p>
    <p align="center" class="Estilo1"><img src="IMG/CPU.JPG" width="404" height="198" /></p>
    <h2 class="Estilo1" id="caractersticas-de-un-cpu">Caracter&iacute;sticas de un CPU</h2>
    <hr />
      <p>&nbsp;</p>
    <p class="Estilo1">Existen ciertas caracter&iacute;sticas que diferencian a un CPU de otro:</p>
    <ul>
      <li><span class="Estilo2"><strong>Consumo energ&eacute;tico</strong>. Refiere a la cantidad de energ&iacute;a que consume el CPU al ejecutar acciones, a mayor calidad, mayor el consumo energ&eacute;tico.</span></li>
      <li class="Estilo2"><strong>Frecuencia de reloj</strong>. Refiere a la velocidad de reloj que tiene el CPU y que determina la cantidad de acciones que puede ejecutar en un per&iacute;odo de&nbsp;tiempo.</li>
      <li class="Estilo2"><strong>N&uacute;mero de n&uacute;cleos</strong>. A mayor cantidad de n&uacute;cleos, mayor la cantidad de acciones que pueden realizarse en forma simult&aacute;nea.</li>
      <li class="Estilo2"><strong>N&uacute;mero de hilos</strong>. Ayuda al&nbsp;procesador&nbsp;a manejar y ejecutar acciones de forma m&aacute;s eficiente. Divide las tareas o procesos para optimizar los tiempos de espera entre una acci&oacute;n y la otra.</li>
      <li class="Estilo2"><strong>Memoria cach&eacute;.</strong>&nbsp;Almacena datos y permite acceder a ellos de manera r&aacute;pida. La velocidad y capacidad de la memoria cach&eacute; mejora el desempe&ntilde;o del dispositivo.</li>
      <li class="Estilo2"><strong>Tipo de bus</strong>. Refiere a la comunicaci&oacute;n que establece el CPU con el resto del sistema.</li>
	  <center><P>
	  <iframe width="560" height="315" src="https://www.youtube.com/embed/k5SU0eJHnZ0" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>
	  </center><P>
    </ul>
    <h2 class="Estilo1" id="partes-del-cpu">Partes del CPU</h2>
    <hr />
      <p>&nbsp;</p>
    <p class="Estilo1">Un CPU est&aacute; compuesto internamente de los siguientes componentes:</p>
    <ul>
      <li><span class="Estilo2"><strong>N&uacute;cleo</strong>. Es la unidad base que constituye a un CPU, que interpreta y ejecuta acciones. Originariamente los procesadores solo ten&iacute;an uno (single core), pero actualmente lo m&iacute;nimo es dos.</span></li>
      <li><span class="Estilo2"><strong>Unidad de control</strong>. Es un circuito digital que extrae la instrucci&oacute;n de la&nbsp;memoria, la descifra y la ejecuta.</span></li>
      <li class="Estilo2"><strong>Unidad aritm&eacute;tica l&oacute;gica</strong>. Es un circuito digital que lleva a cabo las operaciones l&oacute;gicas, matem&aacute;ticas y aritm&eacute;ticas entre los datos.</li>
      <li class="Estilo2"><strong>Unidad de coma flotante</strong>. Es un componente especializado en el c&aacute;lculo de operaciones con coma flotante.</li>
      <li class="Estilo2"><strong>Memoria cach&eacute;</strong>. Es la memoria en la que se almacenan los datos que el usuario consulta con frecuencia, esto permite ganar velocidad al procesador.</li>
      <li class="Estilo2"><strong>Registros</strong>. Es una memoria de alta velocidad que permite controlar y almacenar las instrucciones en ejecuci&oacute;n.</li>
      <li class="Estilo2"><strong>Controlador de memoria</strong>. Es un circuito que puede estar integrado al procesador y que regula el flujo de datos entre el procesador y la memoria.</li>
      <li class="Estilo2"><strong>Bus</strong>. Es un sistema digital que env&iacute;a y recibe datos entre los componentes.</li>
      <li class="Estilo2"><strong>Tarjeta gr&aacute;fica</strong>. Es el componente que procesa los datos de video e imagen, que puede estar incluido o no en el CPU.</li>
    </ul>
    <h2 class="Estilo2" id="tipos-de-cpu">Tipos de CPU</h2>
    <hr />
      <p>&nbsp;</p>
    <p class="Estilo2">Los CPU se clasifican seg&uacute;n la cantidad de n&uacute;cleos en:</p>
    <ul>
      <li><span class="Estilo2"><strong>De un solo n&uacute;cleo</strong>. Existe un solo n&uacute;cleo en el procesador que puede realizar una acci&oacute;n a la vez, es el tipo de procesador m&aacute;s antiguo.</span></li>
      <li class="Estilo2"><strong>De dos n&uacute;cleos</strong>. Existen dos n&uacute;cleos, lo que permite realizar m&aacute;s de una acci&oacute;n a la vez.</li>
      <li class="Estilo2"><strong>De cuatro n&uacute;cleos</strong>. Existen cuatro n&uacute;cleos independientes que permiten realizar varias acciones a la vez, suelen ser procesadores m&aacute;s eficientes que los de dos n&uacute;cleos.</li>
    </ul>
    <p><br />
      <br />
      <br />
	  <marquee width="800" dir="right">
 Fuente:&nbsp;<a href="https://concepto.de/cpu/#ixzz83rSDKRyM">https://concepto.de/cpu/#ixzz83rSDKRyM</a>  </p>
</marquee>
  </blockquote>
</blockquote>
</body>
</html>
